#+TITLE: Figure Drawing II
#+AUTHOR: Chris Hogan
#+DATE: <2021-01-18 Mon> to <2021-02-07 Sun>
#+STARTUP: nologdone

* Watts Figure Drawing Phase I
** Geometric Forms
   - TODO Draw pages of ellipses
   - TODO Wrapping of forms
   - TODO Spheres
   - TODO Combine forms
   - TODO Relate ellipses (cylinder)
** Skeletal Mannequin
   - TODO Copy comic poses using skeletal mannequin
** Block Form Mannequin
   - TODO Trace over photo with block forms, then draw freehand from tracing


** Week 1
  #+BEGIN: clocktable :scope subtree :maxlevel 6 :tags t
  #+CAPTION: Clock summary at [2021-01-24 Sun 20:50]
  | Tags    | Headline                                        | Time    |       |      |      |
  |---------+-------------------------------------------------+---------+-------+------+------|
  |         | *Total time*                                    | *34:21* |       |      |      |
  |---------+-------------------------------------------------+---------+-------+------+------|
  |         | Log                                             | 34:21   |       |      |      |
  |         | \_  Week 1                                      |         | 34:21 |      |      |
  |         | \_    <2021-01-18 Mon>                          |         |       | 6:19 |      |
  | drawing | \_      Copy from Frazetta's Icon               |         |       |      | 0:46 |
  | drawing | \_      Croquis cafe #372                       |         |       |      | 0:35 |
  | drawing | \_      Watts Figure Drawing Phase I            |         |       |      | 4:21 |
  | study   | \_      Watts Figure Drawing Phase I            |         |       |      | 0:37 |
  |         | \_    <2021-01-19 Tue>                          |         |       | 4:03 |      |
  | drawing | \_      Copy from Frazetta's Icon               |         |       |      | 0:45 |
  | drawing | \_      Warmup - geometric forms                |         |       |      | 0:38 |
  | drawing | \_      Croquis cafe #371                       |         |       |      | 0:23 |
  | drawing | \_      Watts Figure Drawing Phase I -...       |         |       |      | 1:55 |
  | study   | \_      Watts Figure Drawing Phase I -...       |         |       |      | 0:22 |
  |         | \_    <2021-01-20 Wed>                          |         |       | 3:42 |      |
  | drawing | \_      Copy from Frazetta's icon               |         |       |      | 0:52 |
  | drawing | \_      Warmup - geometric forms                |         |       |      | 0:10 |
  | drawing | \_      Croquis cafe #370                       |         |       |      | 0:23 |
  | drawing | \_      Watts Figure Drawing Phase I -...       |         |       |      | 1:08 |
  | drawing | \_      Watts Figure Drawing Phase I -...       |         |       |      | 1:09 |
  |         | \_    <2021-01-21 Thu>                          |         |       | 4:03 |      |
  | drawing | \_      Copy from Frazetta's Icon               |         |       |      | 0:44 |
  | drawing | \_      Warmup - geometric forms                |         |       |      | 0:24 |
  | drawing | \_      Croquis Cafe #369                       |         |       |      | 0:23 |
  | drawing | \_      Watts Figure Drawing Phase I -...       |         |       |      | 1:00 |
  | study   | \_      Watts Figure Drawing Phase I - Block... |         |       |      | 0:17 |
  | drawing | \_      Watts Figure Drawing Phase I - Block... |         |       |      | 1:15 |
  |         | \_    <2021-01-22 Fri>                          |         |       | 3:35 |      |
  | drawing | \_      Copy from Frazetta's Icon               |         |       |      | 0:48 |
  | drawing | \_      Warmup - CSI curves                     |         |       |      | 0:19 |
  | drawing | \_      Croquis Cafe #368                       |         |       |      | 0:24 |
  | drawing | \_      Watts Figure Drawing Phase I -...       |         |       |      | 0:41 |
  | drawing | \_      Watts Figure Drawing Phase I - Block... |         |       |      | 1:23 |
  |         | \_    <2021-01-23 Sat>                          |         |       | 6:54 |      |
  | drawing | \_      Copy from Frazetta's Icon               |         |       |      | 0:45 |
  | drawing | \_      Warmup - CSI curves                     |         |       |      | 0:31 |
  | drawing | \_      Croquis Cafe #367                       |         |       |      | 0:24 |
  | drawing | \_      Watts Figure Drawing Phase I -...       |         |       |      | 0:21 |
  | drawing | \_      Watts Figure Drawing Phase I - Block... |         |       |      | 3:37 |
  | drawing | \_      FZD Ep. 54 - Chaos to Control           |         |       |      | 1:16 |
  |         | \_    <2021-01-24 Sun>                          |         |       | 5:45 |      |
  | drawing | \_      Warmup - CSI curves                     |         |       |      | 0:11 |
  | drawing | \_      Croquis Cafe #366                       |         |       |      | 0:24 |
  | drawing | \_      Watts Figure Drawing Phase I - Block... |         |       |      | 3:11 |
  | study   | \_      Watts Figure Drawing Phase I - Ovoid... |         |       |      | 0:43 |
  | study   | \_      Blog                                    |         |       |      | 1:16 |
  #+END:
  #+BEGIN: clocktable-by-tag :scope subtree :maxlevel 6 :match ("drawing" "study")
  | Tag     | Headline   | Time (h) |
  |---------+------------+----------|
  | drawing | *Tag time* | *31h 6m* |
  |---------+------------+----------|
  | study   | *Tag time* | *3h 15m* |

  #+END:
*** <2021-01-18 Mon>
**** DONE Copy from Frazetta's Icon                                 :drawing:
     :LOGBOOK:
     CLOCK: [2021-01-18 Mon 08:09]--[2021-01-18 Mon 08:55] =>  0:46
     :END:
**** DONE Croquis cafe #372                                        :drawing:
     :LOGBOOK:
     CLOCK: [2021-01-18 Mon 10:05]--[2021-01-18 Mon 10:40] =>  0:35
     :END:
**** DONE Watts Figure Drawing Phase I                              :drawing:
     :LOGBOOK:
     CLOCK: [2021-01-18 Mon 18:19]--[2021-01-18 Mon 19:09] =>  0:50
     CLOCK: [2021-01-18 Mon 13:19]--[2021-01-18 Mon 15:50] =>  2:31
     CLOCK: [2021-01-18 Mon 10:51]--[2021-01-18 Mon 11:51] =>  1:00
     :END:
**** DONE Watts Figure Drawing Phase I                                :study:
     :LOGBOOK:
     CLOCK: [2021-01-18 Mon 19:11]--[2021-01-18 Mon 19:48] =>  0:37
     :END:
*** <2021-01-19 Tue>
**** DONE Copy from Frazetta's Icon                                 :drawing:
     :LOGBOOK:
     CLOCK: [2021-01-19 Tue 06:42]--[2021-01-19 Tue 07:27] =>  0:45
     :END:
**** DONE Warmup - geometric forms                                  :drawing:
     :LOGBOOK:
     CLOCK: [2021-01-19 Tue 18:08]--[2021-01-19 Tue 18:46] =>  0:38
     :END:
**** DONE Croquis cafe #371                                         :drawing:
     :LOGBOOK:
     CLOCK: [2021-01-19 Tue 18:47]--[2021-01-19 Tue 19:10] =>  0:23
     :END:
**** DONE Watts Figure Drawing Phase I - Proportion study           :drawing:
     :LOGBOOK:
     CLOCK: [2021-01-19 Tue 20:55]--[2021-01-19 Tue 21:37] =>  0:42
     CLOCK: [2021-01-19 Tue 19:18]--[2021-01-19 Tue 20:31] =>  1:13
     :END:
**** DONE Watts Figure Drawing Phase I - Skeleton Mannequin           :study:
     :LOGBOOK:
     CLOCK: [2021-01-19 Tue 20:33]--[2021-01-19 Tue 20:55] =>  0:22
     :END:
*** <2021-01-20 Wed>
**** DONE Copy from Frazetta's icon                                 :drawing:
     :LOGBOOK:
     CLOCK: [2021-01-20 Wed 06:36]--[2021-01-20 Wed 07:28] =>  0:52
     :END:
**** DONE Warmup - geometric forms                                  :drawing:
     :LOGBOOK:
     CLOCK: [2021-01-20 Wed 18:28]--[2021-01-20 Wed 18:38] =>  0:10
     :END:
**** DONE Croquis cafe #370                                         :drawing:
     :LOGBOOK:
     CLOCK: [2021-01-20 Wed 18:38]--[2021-01-20 Wed 19:01] =>  0:23
     :END:
**** DONE Watts Figure Drawing Phase I - Proportion study           :drawing:
     :LOGBOOK:
     CLOCK: [2021-01-20 Wed 19:02]--[2021-01-20 Wed 20:10] =>  1:08
     :END:
**** DONE Watts Figure Drawing Phase I - Skeleton Mannequin         :drawing:
     :LOGBOOK:
     CLOCK: [2021-01-20 Wed 20:10]--[2021-01-20 Wed 21:19] =>  1:09
     :END:
*** <2021-01-21 Thu>
**** DONE Copy from Frazetta's Icon                                 :drawing:
     :LOGBOOK:
     CLOCK: [2021-01-21 Thu 06:45]--[2021-01-21 Thu 07:29] =>  0:44
     :END:
**** DONE Warmup - geometric forms                                  :drawing:
     :LOGBOOK:
     CLOCK: [2021-01-21 Thu 18:03]--[2021-01-21 Thu 18:27] =>  0:24
     :END:
**** DONE Croquis Cafe #369                                         :drawing:
     :LOGBOOK:
     CLOCK: [2021-01-21 Thu 18:27]--[2021-01-21 Thu 18:50] =>  0:23
     :END:
**** DONE Watts Figure Drawing Phase I - Skeleton Mannequin         :drawing:
     :LOGBOOK:
     CLOCK: [2021-01-21 Thu 18:50]--[2021-01-21 Thu 19:50] =>  1:00
     :END:
**** DONE Watts Figure Drawing Phase I - Block Form Mannequin         :study:
     :LOGBOOK:
     CLOCK: [2021-01-21 Thu 19:50]--[2021-01-21 Thu 20:07] =>  0:17
     :END:
**** DONE Watts Figure Drawing Phase I - Block Form Mannequin       :drawing:
     :LOGBOOK:
     CLOCK: [2021-01-21 Thu 20:07]--[2021-01-21 Thu 21:22] =>  1:15
     :END:
*** <2021-01-22 Fri>
**** DONE Copy from Frazetta's Icon                                 :drawing:
     :LOGBOOK:
     CLOCK: [2021-01-22 Fri 06:38]--[2021-01-22 Fri 07:26] =>  0:48
     :END:
**** DONE Warmup - CSI curves                                       :drawing:
     :LOGBOOK:
     CLOCK: [2021-01-22 Fri 18:15]--[2021-01-22 Fri 18:34] =>  0:19
     :END:
**** DONE Croquis Cafe #368                                         :drawing:
     :LOGBOOK:
     CLOCK: [2021-01-22 Fri 18:39]--[2021-01-22 Fri 19:03] =>  0:24
     :END:
**** DONE Watts Figure Drawing Phase I - Skeleton from photos       :drawing:
     :LOGBOOK:
     CLOCK: [2021-01-22 Fri 19:03]--[2021-01-22 Fri 19:44] =>  0:41
     :END:
**** DONE Watts Figure Drawing Phase I - Block form mannequin       :drawing:
     :LOGBOOK:
     CLOCK: [2021-01-22 Fri 19:44]--[2021-01-22 Fri 21:07] =>  1:23
     :END:
*** <2021-01-23 Sat>
**** DONE Copy from Frazetta's Icon                                 :drawing:
     :LOGBOOK:
     CLOCK: [2021-01-23 Sat 08:05]--[2021-01-23 Sat 08:50] =>  0:45
     :END:
**** DONE Warmup - CSI curves                                       :drawing:
     :LOGBOOK:
     CLOCK: [2021-01-23 Sat 09:03]--[2021-01-23 Sat 09:34] =>  0:31
     :END:
**** DONE Croquis Cafe #367                                         :drawing:
     :LOGBOOK:
     CLOCK: [2021-01-23 Sat 09:34]--[2021-01-23 Sat 09:58] =>  0:24
     :END:
**** DONE Watts Figure Drawing Phase I - Skeleton from photos       :drawing:
     :LOGBOOK:
     CLOCK: [2021-01-23 Sat 10:01]--[2021-01-23 Sat 10:22] =>  0:21
     :END:
**** DONE Watts Figure Drawing Phase I - Block form mannequin       :drawing:
     :LOGBOOK:
     CLOCK: [2021-01-23 Sat 19:59]--[2021-01-23 Sat 21:06] =>  1:07
     CLOCK: [2021-01-23 Sat 14:44]--[2021-01-23 Sat 15:49] =>  1:05
     CLOCK: [2021-01-23 Sat 10:35]--[2021-01-23 Sat 12:00] =>  1:25
     :END:
**** DONE FZD Ep. 54 - Chaos to Control                             :drawing:
     :LOGBOOK:
     CLOCK: [2021-01-23 Sat 13:23]--[2021-01-23 Sat 14:39] =>  1:16
     :END:
*** <2021-01-24 Sun>
**** DONE Warmup - CSI curves                                       :drawing:
     :LOGBOOK:
     CLOCK: [2021-01-24 Sun 10:36]--[2021-01-24 Sun 10:47] =>  0:11
     :END:
**** DONE Croquis Cafe #366                                         :drawing:
     :LOGBOOK:
     CLOCK: [2021-01-24 Sun 10:47]--[2021-01-24 Sun 11:11] =>  0:24
     :END:
**** DONE Watts Figure Drawing Phase I - Block form mannequin       :drawing:
     :LOGBOOK:
     CLOCK: [2021-01-24 Sun 18:17]--[2021-01-24 Sun 19:33] =>  1:16
     CLOCK: [2021-01-24 Sun 13:00]--[2021-01-24 Sun 14:35] =>  1:35
     CLOCK: [2021-01-24 Sun 11:12]--[2021-01-24 Sun 11:32] =>  0:20
     :END:
**** DONE Watts Figure Drawing Phase I - Ovoid mannequin              :study:
     :LOGBOOK:
     CLOCK: [2021-01-24 Sun 17:53]--[2021-01-24 Sun 18:16] =>  0:23
     CLOCK: [2021-01-24 Sun 14:39]--[2021-01-24 Sun 14:59] =>  0:20
     :END:
**** DONE Blog                                                        :study:
     :LOGBOOK:
     CLOCK: [2021-01-24 Sun 19:34]--[2021-01-24 Sun 20:50] =>  1:16
     :END:
** Week 2
#+BEGIN: clocktable :scope subtree :maxlevel 6 :tags t
#+CAPTION: Clock summary at [2021-01-25 Mon 21:17]
| Tags    | Headline                                        | Time   |      |      |      |
|---------+-------------------------------------------------+--------+------+------+------|
|         | *Total time*                                    | *4:02* |      |      |      |
|---------+-------------------------------------------------+--------+------+------+------|
|         | \_  Week 2                                      |        | 4:02 |      |      |
|         | \_    <2021-01-25 Mon>                          |        |      | 4:02 |      |
| drawing | \_      Copy Frazetta                           |        |      |      | 0:43 |
| drawing | \_      Warmup - geometric forms                |        |      |      | 0:16 |
| drawing | \_      Croquis  cafe #365                      |        |      |      | 0:26 |
| drawing | \_      Watts Figure Drawing Phase I - Block... |        |      |      | 0:30 |
| drawing | \_      Watts Figure Drawing Phase I - Ovoid... |        |      |      | 2:07 |
#+END:
#+BEGIN: clocktable-by-tag :scope subtree :maxlevel 6 :match ("drawing" "study")
| Tag     | Headline   | Time (h) |
|---------+------------+----------|
| drawing | *Tag time* | *4h 2m*  |
|---------+------------+----------|
| study   | *Tag time* | *0h 0m*  |

#+END:

*** <2021-01-25 Mon>
**** DONE Copy Frazetta                                             :drawing:
     :LOGBOOK:
     CLOCK: [2021-01-25 Mon 06:47]--[2021-01-25 Mon 07:30] =>  0:43
     :END:
**** DONE Warmup - geometric forms                                  :drawing:
     :LOGBOOK:
     CLOCK: [2021-01-25 Mon 17:58]--[2021-01-25 Mon 18:14] =>  0:16
     :END:
**** DONE Croquis  cafe #365                                        :drawing:
     :LOGBOOK:
     CLOCK: [2021-01-25 Mon 18:14]--[2021-01-25 Mon 18:40] =>  0:26
     :END:
**** DONE Watts Figure Drawing Phase I - Block form mannequin       :drawing:
     :LOGBOOK:
     CLOCK: [2021-01-25 Mon 18:40]--[2021-01-25 Mon 19:10] =>  0:30
     :END:
**** DONE Watts Figure Drawing Phase I - Ovoid mannequin            :drawing:
     :LOGBOOK:
     CLOCK: [2021-01-25 Mon 19:10]--[2021-01-25 Mon 21:17] =>  2:07
     :END:
** Week 3
** Week 4
